// ignore_for_file: avoid_print

void main() async {
  print('----------------Початок програми----------------\n');

  print('\n----------------Кінець програми----------------\n');
}

// Розказати що таке async
// Розказати, що якщо ти зробив функцію асинхронною, то вона має повертати Future
// Розказати, що таке async
// Розказати, що таке Future.delayed і про вхідні параметри.
// Розказати, що таке then - і що воно є у всіх Future.
// Розказати про await.
// Розказати коли на практиці використовують then, а коли await.
// Розказати про правила analytics_options.yaml     - unawaited_futures  - avoid_void_async
